                                                                                             #Wasit Khampeerapakorn 6230479321
x = input()  #รับข้อมูลที่ต้องการแปลงเป็นRLEมา
x += 'S' #เพิ่มตัวแปรที่เข้าไว้ปิดท้ายเข้ามาเพิ่อขยายขอบเขตในการวนลูปในบรรทัดที่5
n = 1 #กำหนดตัวแปรนับตัวซ้ำ
out = '' #กำหนดตัวแปรสำหรับเก็บข้อมูลและเตรียมส่งออก
for i in range(1,len(x)) : #คำสั่งวนลูปตั้งแต่ตัวที่2จนถึงตัวก่อนสุดท้าย เริ่มโดยการหยิบตัวที่2มาเปรียบเทียบกับตัวที่ก่อนหน้าไปเรื่อยๆจนถึงตัวก่อนสุดท้าย ในที่นี้ตัวที่ถูกเพิ่มจากตอนแรก'S'จะไม่ถูกนำมาเช็ค
    if x[i-1] == x[i]: # ถ้าตัวที่2เหมือนตัวแรกจะไปเพิ่ม1หน่วยในตัวแปรนับและวนลูปต่อไป
        n += 1
    else:
        out += str(n) + str(x[i-1]) #ถ้าตัวที่2ไม่เหมือนตัวแรกจะทำการจัดเก็บข้อมูลและจำนวนที่ซ้ำกันโดยให้จำนวนบอกความถี่ที่ซ้ำขึ้นก่อน
        n = 1 #resetตัวแปรนับตัวซ้ำแล้วเริ่มวนลูปตัวถัดไปในบรรทัดที่5
 print(out) #ทำการแสดงข้อมูลจากตัวแปรเก็บข้อมูล
 
 
 